XuanThiep/STM32F1-With-DDS-AD9850/Src/main.c
/**
 ******************************************************************************
 * File Name          : main.c
 * Description        : Main program body
 ******************************************************************************
 *
 * COPYRIGHT(c) 2016 STMicroelectronics
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of STMicroelectronics nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* Define for AD9850 Connection */

#define		WCLK_PORT			GPIOA
#define		WCLK_PIN			GPIO_PIN_0

#define		FQUP_PORT			GPIOA
#define		FQUP_PIN			GPIO_PIN_1

#define		RESET_PORT			GPIOA
#define		RESET_PIN			GPIO_PIN_2

#define		D7_PORT				GPIOA
#define		D7_PIN				GPIO_PIN_3

#define		FREQUENCY_OUT		1.44

/* Note: F_CPU=24 MHz -> Tcpu= 41.6 ns*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void Error_Handler(void);
static void MX_GPIO_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
void ad9850_reset(void);
void ad9850_set_frequency(uint8_t w0, double frequency_in_MHz);

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
void ad9850_reset(void)
{
        /* Init */
        HAL_GPIO_WritePin(RESET_PORT,RESET_PIN,GPIO_PIN_RESET);
        HAL_GPIO_WritePin(FQUP_PORT,FQUP_PIN,GPIO_PIN_RESET);
        HAL_GPIO_WritePin(WCLK_PORT,WCLK_PIN,GPIO_PIN_RESET);
        HAL_GPIO_WritePin(D7_PORT,D7_PIN,GPIO_PIN_RESET);
    
	HAL_GPIO_WritePin(WCLK_PORT,WCLK_PIN,GPIO_PIN_RESET);
	HAL_GPIO_WritePin(FQUP_PORT,FQUP_PIN,GPIO_PIN_RESET);
	__no_operation();

	HAL_GPIO_WritePin(RESET_PORT,RESET_PIN,GPIO_PIN_RESET);
	HAL_GPIO_WritePin(RESET_PORT,RESET_PIN,GPIO_PIN_SET);
        HAL_GPIO_WritePin(RESET_PORT,RESET_PIN,GPIO_PIN_RESET);
	__no_operation();

	HAL_GPIO_WritePin(WCLK_PORT,WCLK_PIN,GPIO_PIN_RESET);
        HAL_GPIO_WritePin(WCLK_PORT,WCLK_PIN,GPIO_PIN_SET);
        HAL_GPIO_WritePin(WCLK_PORT,WCLK_PIN,GPIO_PIN_RESET);
	__no_operation();
	

	__no_operation();
	__no_operation();
        
	HAL_GPIO_WritePin(FQUP_PORT,FQUP_PIN,GPIO_PIN_RESET);
	HAL_GPIO_WritePin(FQUP_PORT,FQUP_PIN,GPIO_PIN_SET);
        HAL_GPIO_WritePin(FQUP_PORT,FQUP_PIN,GPIO_PIN_RESET);
	__no_operation();

}

void ad9850_set_frequency(uint8_t w0, double frequency_in_MHz)
{
	uint8_t i,w;
	uint64_t y;
	double x;

	x=4294967296/125.0;
	//frequency_in_MHz=frequency_in_MHz/1000000;
	y=(uint64_t)(frequency_in_MHz*x);


	//write w4
	w=(uint8_t)(y);
	for(i=0;i<8;i++)
	{
		if((w>>i)&0x01)
		{
			HAL_GPIO_WritePin(D7_PORT,D7_PIN,GPIO_PIN_SET);
		}
		else
		{
			HAL_GPIO_WritePin(D7_PORT,D7_PIN,GPIO_PIN_RESET);
		}
		HAL_GPIO_WritePin(WCLK_PORT,WCLK_PIN,GPIO_PIN_SET);
		HAL_GPIO_WritePin(WCLK_PORT,WCLK_PIN,GPIO_PIN_RESET);

	}

	 //write w3
	w=(uint8_t)(y>>8);
	for(i=0;i<8;i++)
	{
		if((w>>i)&0x01)
		{
			HAL_GPIO_WritePin(D7_PORT,D7_PIN,GPIO_PIN_SET);
		}
		else
		{
			HAL_GPIO_WritePin(D7_PORT,D7_PIN,GPIO_PIN_RESET);
		}
		HAL_GPIO_WritePin(WCLK_PORT,WCLK_PIN,GPIO_PIN_SET);
		HAL_GPIO_WritePin(WCLK_PORT,WCLK_PIN,GPIO_PIN_RESET);

	}

	//write w2
	w=(uint8_t)(y>>16);
	for(i=0;i<8;i++)
	{
		if((w>>i)&0x01)
		{
			HAL_GPIO_WritePin(D7_PORT,D7_PIN,GPIO_PIN_SET);
		}
		else
		{
			HAL_GPIO_WritePin(D7_PORT,D7_PIN,GPIO_PIN_RESET);
		}
		HAL_GPIO_WritePin(WCLK_PORT,WCLK_PIN,GPIO_PIN_SET);
		HAL_GPIO_WritePin(WCLK_PORT,WCLK_PIN,GPIO_PIN_RESET);

	}

	//write w1
	w=(uint8_t)(y>>24);
	for(i=0;i<8;i++)
	{
		if((w>>i)&0x01)
		{
			HAL_GPIO_WritePin(D7_PORT,D7_PIN,GPIO_PIN_SET);
		}
		else
		{
			HAL_GPIO_WritePin(D7_PORT,D7_PIN,GPIO_PIN_RESET);
		}
		HAL_GPIO_WritePin(WCLK_PORT,WCLK_PIN,GPIO_PIN_SET);
		HAL_GPIO_WritePin(WCLK_PORT,WCLK_PIN,GPIO_PIN_RESET);

	}

	w=w0;
	for(i=0;i<8;i++)
	{
		if((w>>i)&0x01)
		{
			HAL_GPIO_WritePin(D7_PORT,D7_PIN,GPIO_PIN_SET);
		}
		else
		{
			HAL_GPIO_WritePin(D7_PORT,D7_PIN,GPIO_PIN_RESET);
		}
		HAL_GPIO_WritePin(WCLK_PORT,WCLK_PIN,GPIO_PIN_SET);
		HAL_GPIO_WritePin(WCLK_PORT,WCLK_PIN,GPIO_PIN_RESET);

	}

	HAL_GPIO_WritePin(FQUP_PORT,FQUP_PIN,GPIO_PIN_SET);
	HAL_GPIO_WritePin(FQUP_PORT,FQUP_PIN,GPIO_PIN_RESET);


}
/* USER CODE END 0 */

int main(void)
{

	/* USER CODE BEGIN 1 */

	/* USER CODE END 1 */

	/* MCU Configuration----------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* Configure the system clock */
	SystemClock_Config();

	/* Initialize all configured peripherals */
	MX_GPIO_Init();

	/* USER CODE BEGIN 2 */
	ad9850_reset();
	ad9850_set_frequency(0x00,FREQUENCY_OUT);
	/* USER CODE END 2 */

	/* Infinite loop */
	/* USER CODE BEGIN WHILE */
	while (1)
	{
		/* USER CODE END WHILE */

		/* USER CODE BEGIN 3 */

	}
	/* USER CODE END 3 */

}

/** System Clock Configuration
 */
void SystemClock_Config(void)
{

	RCC_OscInitTypeDef RCC_OscInitStruct;
	RCC_ClkInitTypeDef RCC_ClkInitStruct;

	/**Initializes the CPU, AHB and APB busses clocks
	 */
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
	RCC_OscInitStruct.HSEState = RCC_HSE_ON;
	RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
	RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL3;
	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
	{
		Error_Handler();
	}

	/**Initializes the CPU, AHB and APB busses clocks
	 */
	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
			|RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
	RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

	if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
	{
		Error_Handler();
	}

	/**Configure the Systick interrupt time
	 */
	HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

	/**Configure the Systick
	 */
	HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

	/* SysTick_IRQn interrupt configuration */
	HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/** Configure pins as 
 * Analog
 * Input
 * Output
 * EVENT_OUT
 * EXTI
 */
static void MX_GPIO_Init(void)
{

	GPIO_InitTypeDef GPIO_InitStruct;

	/* GPIO Ports Clock Enable */
	__HAL_RCC_GPIOD_CLK_ENABLE();
	__HAL_RCC_GPIOA_CLK_ENABLE();

	/*Configure GPIO pin Output Level */
	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_2|GPIO_PIN_3, GPIO_PIN_SET);

	/*Configure GPIO pins : PA0 PA1 PA2 PA3 */
	GPIO_InitStruct.Pin = GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_2|GPIO_PIN_3;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
 * @brief  This function is executed in case of error occurrence.
 * @param  None
 * @retval None
 */
void Error_Handler(void)
{
	/* USER CODE BEGIN Error_Handler */
	/* User can add his own implementation to report the HAL error return state */
	while(1)
	{
	}
	/* USER CODE END Error_Handler */
}

#ifdef USE_FULL_ASSERT

/**
 * @brief Reports the name of the source file and the source line number
 * where the assert_param error has occurred.
 * @param file: pointer to the source file name
 * @param line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t* file, uint32_t line)
{
	/* USER CODE BEGIN 6 */
	/* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
	/* USER CODE END 6 */

}

#endif

/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
